{
  "BaseLevel": {
    "fr": ["Vous êtes mort, détective."],
    "en": ["You're dead, detective."]
  },
  "StartScreen": {
    "fr": [
      "Bienvenue dans mon super jeu :) Pour activer ou désactiver une option, positionnez-vous devant l'interrupteur et appuyez sur ENTRÉE.\nVous pouvez aussi simplement cliquer sur les différentes options pour les activer ou les désactiver."
    ],
    "en": [
      "Welcome to my great game :) To activate or deactivate an option, position yourself in front of the switch and press ENTER.\nYou can also simply click on the different options to activate or deactivate them."
    ]
  },
  "Level1": {
    "fr": [
      "Bonjour détective, merci d'être intervenu aussi rapidement. Le meurtre du professeur Colder est vraiment dramatique.\nPardon, je ne me suis pas présenté : Je suis Bob, l'IA de ce laboratoire. Je vais vous guider jusqu'au lieu du crime, dans la salle 823.\nPour passer d'une salle à l'autre, veuillez vous diriger vers la porte de sortie. C'est aussi simple que ça.",
      "Une fois positionné, appuyez sur ENTRÉE pour passer à la salle suivante."
    ],
    "en": [
      "Hello detective, thank you for intervening so quickly. The murder of Professor Colder is truly dramatic.\nSorry, I didn't introduce myself: I'm Bob, the AI in this lab. I'll guide you to the crime scene in room 823.\nTo move between rooms, please head for the exit door. It's that simple.",
      "Once positioned, press ENTER to move to the next room."
    ]
  },
  "Level2": {
    "fr": [
      "Félicitations détective. Vous faites honneur à votre profession.\nDans cette salle, pour accèder à la sortie veuillez empruntez le portail qui se trouve à l'autre bout de la salle.",
      "Une fois positionné, appuyez sur ENTRÉE pour être téléporté sur la plateforme supérieure.\nOui oui, vous avez bien entendu : vous allez être téléporté. Notre laboratoire expérimente les voyages spatiaux, ceux-ci incluant les portails de téléportation.\n...\n...\nN'ayez pas peur, nous savons ce que nous faisons."
    ],
    "en": [
      "Congratulations detective. You do honor to your profession.\nIn this room, to access the exit, please use the portal at the other end of the room.",
      "Once positioned, press ENTER to be teleported to the upper platform.\nYes, you heard right: you will be teleported. Our lab experiments with space travel, including teleportation portals.\n...\n...\nFear not, we know what we're doing."
    ]
  },
  "Level3": {
    "fr": [
      "ALERT ! ALERTE ! PARADOXE TEMPORELLE DÉTECTÉE ! PROTOCOLE DE SÉCURITÉ ENCLANCHÉ !\nPardon détective, je m'emporte. Il semblerait qu'il y ait eu comme un léger... bug...\nCes nouveaux types de portails sont encore en cours d'expérimentation. Pour accroître l'efficacité de notre technologie révolutionnaire, nous expérimentons la téléportation spatiale ET temporelle.\nDurant votre téléportation, vous auriez dû faire un saut de 2 secondes dans le futur. Mais il semblerait que vous ayez fait un saut de 2 secondes DANS LE PASSÉ !\nNe me regardez pas comme ça détective, nous sommes un laboratoire d'expérimentations après tout !\nCe saut dans le temps a créé une paradoxe temporelle : comme vous pouvez le voir, votre ... vous du passé se trouve encore de l'autre côté du portail.\nWoooooh il semble très en colère lui aussi.\nNotre protocole de sécurité implique de verrouiller la porte de sortie de cette salle. Si vous empruntez malgré tout cette porte, elle vous téléportera à l'entrée de la salle.\nNous débloqueront donc la sortie lorsque vous vous serez débarassé de votre vous du passé.\n...\n...\nOui, je parle bien de l'assassiner... le descendre... le refroidir...\n...\n...\nOk ok, vous avez saisi.\nOui, c'est un peu... radical. Mais les paradoxes temporelles sont bien pires qu'un petit meurtre, vous en conviendrez.\nPour vous servir de votre arme, appuyez sur ESPACE. Mais je ne vous apprends rien, détective.\nJe vous laisse donc essayer votre arme de service.",
      "Joli tir détective, je suis impressionné !\n...\nOh j'oubliais, le bouton vert au-dessus de vous permet de désactiver les portails verts. Une fois positionné devant, appuyez sur ENTRÉE pour activer le bouton.\n...\n...\nOui maintenant que j'y pense, nous aurions peut-être dû mettre des boutons verts un peu partout. Je vais noter ça dans notre todo list.",
      "Vous êtes vraiment un détective très intelligent, détective.\nDans cette salle, nous expérimentons un nouveau type de portails. Plus rapides, plus performants, plus cool !\nEn traversant le portail vert en face de vous, vous allez être téléporté de l'autre côté.\n...\n...\nJe sais que ce n'est pas grand chose, mais il fallait bien que nous commencions les expérimentations quelque part.\n...\n...\nFaites-nous confiance, nous sommes des ingénieurs."
    ],
    "en": [
      "ALERT! ALERT! TIME PARADOX DETECTED! SECURITY PROTOCOL ENGAGED!\nExcuse me, detective, I'm getting carried away. There seems to have been a slight... bug...\nThese new types of portals are still in experimentation course. To increase the effectiveness of our revolutionary technology, we are experimenting with spatial AND temporal teleportation.\nDuring your teleportation, you should have jumped 2 seconds into the future. But it looks like you jumped 2 seconds IN THE PAST!\nDon't look at me like that detective, we're a lab for experiments after all!\nThis time jump has created a temporal paradox: as you can see, your... you du past is still on the other side of the portal.\nWoooooh he seems very angry too.\nOur security protocol involves locking the exit door to this room. If you do enter this door anyway, it will teleport you to the entrance to the room the.\nSo we'll unlock the exit when you get rid of your past self.\n...\n...\nYes, I'm talking about murdering him...killing him...cooling him down. ..\n...\n...\nOk ok, you got it.\nYes, that's a bit...radical. But time paradoxes are much worse than a little murder, you'll agree.\nTo use your weapon, press SPACE. But I'm not telling you anything, detective.\nI'll let you try your service weapon.",
      "Nice shot detective, I'm impressed!\n...\nOh I forgot, the green button above you allows you to deactivate the green portals. Once positioned in front, press ENTER to activate the button.\n ...\n...\nYeah now that I think about it, maybe we should have put green buttons all over the place. I'll put that on our todo list.",
      "You really are a very smart detective, detective.\nIn this room we are experimenting with a new kind of portals. Faster, better, cooler!\nWalking through the green portal in front of you, you will be teleported from the 'other side.\n...\n...\nI know it's not much, but we had to start experimenting somewhere.\n...\n...\nDo Trust us, we are engineers."
    ]
  },
  "Level4": {
    "fr": [
      "Eh bien détective, vous faites un fabuleux sujet d'expér... heu... je voulais dire un fabuleux représentant de la justice !\nLe téléporteur rouge en face de vous va vous envoyer de l'autre côté du second téléporteur rouge.\n...\n...\nGare aux paradoxes !"
    ],
    "en": [
      "Well detective, you make a fabulous test subject... er... I meant a fabulous representative of justice!\nThe red teleporter in front of you will send you to the other side of the second red teleporter. \n...\n...\nBeware of paradoxes!"
    ]
  },
  "Level6": {
    "fr": [
      "Je suis très fier de vous détective ! Vous vous en sortez très bien !\n...\n...\nMais... je sens que vous êtes un peu en colère. Vous devriez respirer profondément, un cerveau aussi brillant que le vôtre mérite d'être suffisament oxygéné.`",
      "Vous voyez ces portails orange ?\n...\n...\nParfait, vous avez une excellente vue.\nSi vous activez un des boutons orange, vous désactiverez les autres portails en alternance.\n...\n...\nBien, vous savez ce qu'ils vous restent à faire pour quitter cette salle."
    ],
    "en": [
      "I'm very proud of you detective! You're doing very well!\n...\n...\nBut...I sense you're a little angry. You should take a deep breath, such a brilliant brain that yours deserves to be sufficiently oxygenated.`",
      "See those orange portals?\n...\n...\nPerfect, you have excellent eyesight.\nIf you activate one of the orange buttons, you will alternately deactivate the other portals.\n...\n ...\nWell, you know what you have to do to leave this room."
    ]
  }
}
